<a href="https://colab.research.google.com/github/QiyuLiu21/L04/blob/master/Salary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv('/content/drive/MyDrive/Salaries.csv')

In [4]:
data.describe

<bound method NDFrame.describe of             Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]>

In [5]:
data.head(10)

   Id        EmployeeName  ...         Agency  Status
0   1      NATHANIEL FORD  ...  San Francisco     NaN
1   2        GARY JIMENEZ  ...  San Francisco     NaN
2   3      ALBERT PARDINI  ...  San Francisco     NaN
3   4   CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5     PATRICK GARDNER  ...  San Francisco     NaN
5   6      DAVID SULLIVAN  ...  San Francisco     NaN
6   7           ALSON LEE  ...  San Francisco     NaN
7   8       DAVID KUSHNER  ...  San Francisco     NaN
8   9      MICHAEL MORRIS  ...  San Francisco     NaN
9  10  JOANNE HAYES-WHITE  ...  San Francisco     NaN

[10 rows x 13 columns]

# What is the average BasePay?

In [6]:
data['BasePay'].mean()

66325.44884050643

# What is the highest amount of overtime in the database?

In [7]:
data['OvertimePay'].max()

245131.88

# What is the job title of Joseph Driscoll?

In [31]:
data[data['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [ ]:
employee=input("Enter an employee name: ")
totalPay = data[data['EmployeeName']==employee]['JobTitle']

# What is the name of the highest paid person?(including benefits)

In [32]:
data[data['TotalPayBenefits']==data['TotalPayBenefits'].max()]
data.loc[data['TotalPayBenefits'].idmax()]
data[data['TotalPayBenefits']==data['EmployeeName'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

# What is the name of the lowest paid person?(including benefits)

In [33]:
data[data['TotalPayBenefits']==data['TotalPayBenefits'].min()]

            Id EmployeeName  ...         Agency  Status
148653  148654    Joe Lopez  ...  San Francisco     NaN

[1 rows x 13 columns]

# What was the average(mean) basepay of all employee per year?

In [34]:
data.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

# How many unique job titles are there?

In [35]:
data['JobTitle'].nunique()

2159

# What are the top 5 most common jobs?

In [36]:
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

# How many job titles were represented by only one person in 2013?

In [39]:
sum(data[data['Year']==2013]['JobTitle'].value_counts()==1)

202

# How many people have the world chief in their job title?

In [40]:
def chief_string(title):
  if 'chief' in title.lower():
    return True
  else:
    return False

In [41]:
sum(data['JobTitle'].apply(lambda x: chief_string(x)))

627